projects/regiftr/app/controllers/gifts_controller.rb

SELECT "gifts".* FROM "gifts"
---
    def index
        gifts = Gift.all

INSERT INTO "gifts" ("description", "value", "event", "gift_giver", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["description", "Borat DVD"], ["value", 7], ["event", "Halloween"], ["gift_giver", "Tom Brady"], ["created_at", "2020-09-19 21:14:46.871025"], ["updated_at", "2020-09-19 21:14:46.871025"]]
---
    def create
        gift = Gift.new(gift_params)
        if gift.save

SELECT "gifts".* FROM "gifts" WHERE "gifts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "gifts" SET "gift_giver" = $1, "updated_at" = $2 WHERE "gifts"."id" = $3  [["gift_giver", "yoshi"], ["updated_at", "2020-09-19 21:21:31.946259"], ["id", 6]]
---
    def update
        gift = Gift.find(params[:id])
        gift.update(gift_params)

DELETE FROM "gifts" WHERE "gifts"."id" = $1  [["id", 11]]
---
    def destroy
        gift = Gift.destroy(params[:id])